Revit 2027 API
ParameterTypeId.ViewSheetViewportInfo Property
 "Viewport"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSheetViewportInfo { get; }
Public Shared ReadOnly Property ViewSheetViewportInfo As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSheetViewportInfo {
	ForgeTypeId^ get ();
}
static member ViewSheetViewportInfo : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace